openfoam/arc_M1.6_fin6/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       sutherland;
    thermo          janaf;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    // normalised gas
    specie
    {
        molWeight       28.96;
    }
    thermodynamics
    {
        Tlow 50;
        Thigh 6000;
        Tcommon 1000;
        highCpCoeffs (3.5 0 0 0 0 -1047 3.7);
        lowCpCoeffs  (3.5 0 0 0 0 -1047 3.7);
    }
    transport
    {
        As 1.458e-6;
        Ts 110.4;
    }
}


// ************************************************************************* //
